garyPenhook/PyAvrOCD/svd/avr64dd32.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WDT</name>
      <description>Watch-Dog Timer</description>
      <baseAddress>0x00800100</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PERIOD</name>
              <description>Period</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8CLK</name>
                  <description>8 cycles (8ms)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16CLK</name>
                  <description>16 cycles (16ms)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32CLK</name>
                  <description>32 cycles (32ms)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64CLK</name>
                  <description>64 cycles (64ms)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128CLK</name>
                  <description>128 cycles (0.128s)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256CLK</name>
                  <description>256 cycles (0.256s)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512CLK</name>
                  <description>512 cycles (0.512s)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1KCLK</name>
                  <description>1K cycles (1.0s)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2KCLK</name>
                  <description>2K cycles (2.0s)</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4KCLK</name>
                  <description>4K cycles (4.1s)</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8KCLK</name>
                  <description>8K cycles (8.2s)</description>
                  <value>11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WINDOW</name>
              <description>Window</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8CLK</name>
                  <description>8 cycles (8ms)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16CLK</name>
                  <description>16 cycles (16ms)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32CLK</name>
                  <description>32 cycles (32ms)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64CLK</name>
                  <description>64 cycles (64ms)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128CLK</name>
                  <description>128 cycles (0.128s)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256CLK</name>
                  <description>256 cycles (0.256s)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512CLK</name>
                  <description>512 cycles (0.512s)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1KCLK</name>
                  <description>1K cycles (1.0s)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2KCLK</name>
                  <description>2K cycles (2.0s)</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4KCLK</name>
                  <description>4K cycles (4.1s)</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8KCLK</name>
                  <description>8K cycles (8.2s)</description>
                  <value>11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SYNCBUSY</name>
              <description>Syncronization busy</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LOCK</name>
              <description>Lock enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
